8.org
#+TITLE: 求值和纠错
#+SETUPFILE: ./resource/template.org

* 在本章：
*有限版本的save-excursion*
*eval*
*宏函数*
*反引用和去引用*
*返回值*
*优雅的失败*
*点标记*

在前面的章节里，我们注意到save-excursion是一个消耗比较大的函数，而我们尝试在refill函数中尽量少的调用它(因为每次buffer改变时都会执行，所以我们需要它尽可能的快)。然而，在refill中仍然包含了五次对于save-excursion的调用。

我们可以尝试将save-excursion的使用进行合并--例如，可以将refill的整个函数体用save-excursion包起来，将里面其他的save-excursion都删掉，重新编写里面的代码来确保光标能够正确的放置。但是这会影响到我们代码布局的清晰性。当然，在某些情况下为了优化可以牺牲掉代码的清晰性，但是在我们考虑合并save-excursion之前，让我们看看我们是否还有别的方法。我们可以寻找另一个更适合的函数来替代它。

在本章中我们将会尝试编写一个更快的，有限版本的save-excursion。我们将会遇到很多有趣的有着一个共同目的的特性：控制表达式何时执行以及它们对于周围代码的影响。我们将会关注这些返回值相关的问题以及在发生错误时如何清理。我们将会看到如何使Lisp解释器延后对于表达式的求值，直到你希望它做为止。我们甚至能找到更改函数执行的顺序的方法。

* 有限版本的save-excursion
save-excursion的目的是在执行完一些Lisp表达式之后恢复"point"的值；但这并不是它所有的能力。它也会恢复"mark"的值，恢复Emacs对于哪个buffer是当前buffer的认知。对于refill来说这过于强大了；毕竟，我们只改变了point的值。我们并没有切换buffer或者移动mark。

我们可以编写一个仅仅满足我们需求的缩减版本的save-excursion。也就是说，我们需要编写一个接收任何数量Lisp表达式作为参数的函数，做如下事情：
1. 记录point的位置
2. 按顺序对每个子表达式求值
3. 将point恢复到初始值

我们遇到的第一个问题是在执行Lisp函数时，它的参数会在这个函数获得控制权之前执行。换句话说，如果我们编写一个名为limited-save-excursion的函数并且这么调用它：
#+BEGIN_SRC emacs-lisp
  (limited-save-excursion
   (beginning-of-line)
   (point))
#+END_SRC

那么调用顺序如下：
1. (beginning-of-line)执行，point移动至当前行的开始并且返回nil。
2. (point)执行，返回光标移动到的位置。
3. limited-save-excursion执行，参数为刚才函数返回的值--也就是nil和一个数字。

在这个例子里，limited-save-excursion无法记录子表达式执行之前的point位置；而计算出来的nil和光标的位置很显然也并没有什么用。

* eval
我们可以通过引用来绕过这个问题：
#+BEGIN_SRC emacs-lisp
  (limited-save-excursion
   '(beginning-of-line)
   '(point))
#+END_SRC

这一次limit-save-excursion的参数是(beginning-of-line)和(point)。它能够记录point的值，正确的按顺序执行子表达式，然后恢复point并且返回。它大概可以实现为下面的样子。
#+BEGIN_SRC emacs-lisp
  (defun limited-save-excursion (&rest exprs)
    "Like save-excursion, but only restores point."
    (let ((saved-point (point))) ; 记录point
      (while exprs
        (eval (car exprs)) ; 执行下一个参数
        (setq exprs (cdr exprs)))
      (goto-char saved-point))) ; 恢复point
#+END_SRC

这个函数有一些新的东西：即eval的调用，它使用一个Lisp表达式作为参数然后执行它。乍看起来这可能并没有什么新鲜的，因为毕竟Lisp解释器能够自动执行Lisp表达式，而不必额外的调用eval。但是有时表达式执行的返回值是另一个你想要执行的Lisp表达式，而Lisp本身并不会自动执行这个表达式。如果我们只执行(car exprs)，我们将会提取出列表中的第一个子表达式，然后就把它丢掉了！我们需要显式调用eval使那个表达式能为我们所用。

下面是一个用来展示Emacs通常的执行行为以及eval的必要性的简单例子：
#+BEGIN_SRC emacs-lisp
  (setq x '(+ 3 5))
  x -> (+ 3 5) ; 对x求值
  (eval x) -> 8 ; 对x的值求值
#+END_SRC

* 宏函数
虽然limited-save-excursion在给参数加上引用符之后就正常工作了，但是这对于调用者来说很繁琐，而且这会导致它不能成为save-excursion的合格替代者(毕竟save-excursion并没有这个限制)。

我们可以实现一种称为宏函数(macro function)[[[8-31][31]]]的特殊函数，它的参数都是默认被引用的。也就是说，当宏函数执行时，它的参数在它获得控制权之前都是不会被执行的。作为替代的，宏函数会产生一些值，通常是其参数的重新排列，然后这些值会被执行。

这里有一个简单的例子。假设我们想要一个称为incr的函数，它的作用是将一个数值变量增加1。我们希望它有这种行为：
#+BEGIN_SRC emacs-lisp
  (setq x 17)
  (incr x)
  x -> 18
#+END_SRC

如果incr是一个普通函数，那么它的参数将会是17，而不是x，因此也不会影响x的值。所以incr必须是一个宏函数。它的输出必须是一个表达式，当这个表达式执行的时候就会对其参数里引用的变量的值加1。

宏函数使用defmacro定义(语法跟defun类似)。incr的写法如下：
#+BEGIN_SRC emacs-lisp
  (defmacro incr (var)
    "Add one to the named variable."
    (list 'setq var (list '+ var 1)))
#+END_SRC

宏函数的函数体是对于入参的一个展开式。然后这个展开式会被求值。(incr x)的展开式是：
#+BEGIN_SRC emacs-lisp
  (setq x (+ x 1))
#+END_SRC

当对这个表达式求值的时候，x将会被加一。

你可以使用函数macroexpand函数来调试宏函数。这是一个把Lisp表达式作为输入，返回它的宏展开结果的函数。如果输入的表达式不是一个宏，那么将会返回原表达式。所以：
#+BEGIN_SRC emacs-lisp
  (macroexpand '(incr x)) -> (setq x (+ x 1))
#+END_SRC

