html/8.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-27 Tue 09:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>求值和纠错</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shuai Zhao" />
<link rel="stylesheet" type="text/css" href="../resource/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">求值和纠错</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org388fb3e">1. 在本章：</a></li>
<li><a href="#org5879fcd">2. 有限版本的save-excursion</a></li>
<li><a href="#orga8d3912">3. eval</a></li>
<li><a href="#org0d5972a">4. 宏函数</a></li>
<li><a href="#org4b6e371">5. 反引用和去引用(Backquote and Unquote)</a></li>
<li><a href="#org640d227">6. 返回值</a></li>
<li><a href="#org9b690cc">7. 优雅的失败</a></li>
<li><a href="#org176738c">8. 点标记</a></li>
</ul>
</div>
</div>

<div id="outline-container-org388fb3e" class="outline-2">
<h2 id="org388fb3e"><span class="section-number-2">1</span> 在本章：</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>有限版本的save-excursion</b><br />
<b>eval</b><br />
<b>宏函数</b><br />
<b>反引用和去引用</b><br />
<b>返回值</b><br />
<b>优雅的失败</b><br />
<b>点标记</b><br />
</p>

<p>
在前面的章节里，我们注意到save-excursion是一个消耗比较大的函数，而我们尝试在refill函数中尽量少的调用它(因为每次buffer改变时都会执行，所以我们需要它尽可能的快)。然而，在refill中仍然包含了五次对于save-excursion的调用。<br />
</p>

<p>
我们可以尝试将save-excursion的使用进行合并&#x2013;例如，可以将refill的整个函数体用save-excursion包起来，将里面其他的save-excursion都删掉，重新编写里面的代码来确保光标能够正确的放置。但是这会影响到我们代码布局的清晰性。当然，在某些情况下为了优化可以牺牲掉代码的清晰性，但是在我们考虑合并save-excursion之前，让我们看看我们是否还有别的方法。我们可以寻找另一个更适合的函数来替代它。<br />
</p>

<p>
在本章中我们将会尝试编写一个更快的，有限版本的save-excursion。我们将会遇到很多有趣的有着一个共同目的的特性：控制表达式何时执行以及它们对于周围代码的影响。我们将会关注这些返回值相关的问题以及在发生错误时如何清理。我们将会看到如何使Lisp解释器延后对于表达式的求值，直到你希望它做为止。我们甚至能找到更改函数执行的顺序的方法。<br />
</p>
</div>
</div>

<div id="outline-container-org5879fcd" class="outline-2">
<h2 id="org5879fcd"><span class="section-number-2">2</span> 有限版本的save-excursion</h2>
<div class="outline-text-2" id="text-2">
<p>
save-excursion的目的是在执行完一些Lisp表达式之后恢复"point"的值；但这并不是它所有的能力。它也会恢复"mark"的值，恢复Emacs对于哪个buffer是当前buffer的认知。对于refill来说这过于强大了；毕竟，我们只改变了point的值。我们并没有切换buffer或者移动mark。<br />
</p>

<p>
我们可以编写一个仅仅满足我们需求的缩减版本的save-excursion。也就是说，我们需要编写一个接收任何数量Lisp表达式作为参数的函数，做如下事情：<br />
</p>
<ol class="org-ol">
<li>记录point的位置<br /></li>
<li>按顺序对每个子表达式求值<br /></li>
<li>将point恢复到初始值<br /></li>
</ol>

<p>
我们遇到的第一个问题是在执行Lisp函数时，它的参数会在这个函数获得控制权之前执行。换句话说，如果我们编写一个名为limited-save-excursion的函数并且这么调用它：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>limited-save-excursion
 <span style="color: #66D9EF;">(</span>beginning-of-line<span style="color: #66D9EF;">)</span>
 <span style="color: #66D9EF;">(</span>point<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
那么调用顺序如下：<br />
</p>
<ol class="org-ol">
<li>(beginning-of-line)执行，point移动至当前行的开始并且返回nil。<br /></li>
<li>(point)执行，返回光标移动到的位置。<br /></li>
<li>limited-save-excursion执行，参数为刚才函数返回的值&#x2013;也就是nil和一个数字。<br /></li>
</ol>

<p>
在这个例子里，limited-save-excursion无法记录子表达式执行之前的point位置；而计算出来的nil和光标的位置很显然也并没有什么用。<br />
</p>
</div>
</div>

<div id="outline-container-orga8d3912" class="outline-2">
<h2 id="orga8d3912"><span class="section-number-2">3</span> eval</h2>
<div class="outline-text-2" id="text-3">
<p>
我们可以通过引用来绕过这个问题：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>limited-save-excursion
 '<span style="color: #66D9EF;">(</span>beginning-of-line<span style="color: #66D9EF;">)</span>
 '<span style="color: #66D9EF;">(</span>point<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
这一次limit-save-excursion的参数是(beginning-of-line)和(point)。它能够记录point的值，正确的按顺序执行子表达式，然后恢复point并且返回。它大概可以实现为下面的样子。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">limited-save-excursion</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">&amp;rest</span> exprs<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Like save-excursion, but only restores point."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">let</span> <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span>saved-point <span style="color: #FD971F;">(</span>point<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">&#35760;&#24405;point</span>
    <span style="color: #A6E22E;">(</span><span style="color: #F92672;">while</span> exprs
      <span style="color: #E6DB74;">(</span>eval <span style="color: #FD971F;">(</span>car exprs<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">&#25191;&#34892;&#19979;&#19968;&#20010;&#21442;&#25968;</span>
      <span style="color: #E6DB74;">(</span><span style="color: #F92672;">setq</span> exprs <span style="color: #FD971F;">(</span>cdr exprs<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
    <span style="color: #A6E22E;">(</span>goto-char saved-point<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">&#24674;&#22797;point</span>
</pre>
</div>

<p>
这个函数有一些新的东西：即eval的调用，它使用一个Lisp表达式作为参数然后执行它。乍看起来这可能并没有什么新鲜的，因为毕竟Lisp解释器能够自动执行Lisp表达式，而不必额外的调用eval。但是有时表达式执行的返回值是另一个你想要执行的Lisp表达式，而Lisp本身并不会自动执行这个表达式。如果我们只执行(car exprs)，我们将会提取出列表中的第一个子表达式，然后就把它丢掉了！我们需要显式调用eval使那个表达式能为我们所用。<br />
</p>

<p>
下面是一个用来展示Emacs通常的执行行为以及eval的必要性的简单例子：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> x '<span style="color: #66D9EF;">(</span>+ 3 5<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
x -&gt; <span style="color: #AE81FF;">(</span>+ 3 5<span style="color: #AE81FF;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">&#23545;x&#27714;&#20540;</span>
<span style="color: #AE81FF;">(</span>eval x<span style="color: #AE81FF;">)</span> -&gt; 8 <span style="color: #75715E;">; </span><span style="color: #75715E;">&#23545;x&#30340;&#20540;&#27714;&#20540;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0d5972a" class="outline-2">
<h2 id="org0d5972a"><span class="section-number-2">4</span> 宏函数</h2>
<div class="outline-text-2" id="text-4">
<p>
虽然limited-save-excursion在给参数加上引用符之后就正常工作了，但是这对于调用者来说很繁琐，而且这会导致它不能成为save-excursion的合格替代者(毕竟save-excursion并没有这个限制)。<br />
</p>

<p>
我们可以实现一种称为宏函数(macro function)[<a href="#org71d3ab2">31</a>]的特殊函数，它的参数都是默认被引用的。也就是说，当宏函数执行时，它的参数在它获得控制权之前都是不会被执行的。作为替代的，宏函数会产生一些值，通常是其参数的重新排列，然后这些值会被执行。<br />
</p>

<p>
这里有一个简单的例子。假设我们想要一个称为incr的函数，它的作用是将一个数值变量增加1。我们希望它有这种行为：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> x 17<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>incr x<span style="color: #AE81FF;">)</span>
x -&gt; 18
</pre>
</div>

<p>
如果incr是一个普通函数，那么它的参数将会是17，而不是x，因此也不会影响x的值。所以incr必须是一个宏函数。它的输出必须是一个表达式，当这个表达式执行的时候就会对其参数里引用的变量的值加1。<br />
</p>

<p>
宏函数使用defmacro定义(语法跟defun类似)。incr的写法如下：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defmacro</span> <span style="color: #A6E22E;">incr</span> <span style="color: #66D9EF;">(</span>var<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Add one to the named variable."</span>
  <span style="color: #66D9EF;">(</span>list 'setq var <span style="color: #A6E22E;">(</span>list '+ var 1<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
宏函数的函数体是对于入参的一个展开式。然后这个展开式会被求值。(incr x)的展开式是：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> x <span style="color: #66D9EF;">(</span>+ x 1<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
当对这个表达式求值的时候，x将会被加一。<br />
</p>

<p>
你可以使用函数macroexpand函数来调试宏函数。这是一个把Lisp表达式作为输入，返回它的宏展开结果的函数。如果输入的表达式不是一个宏，那么将会返回原表达式。所以：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>macroexpand '<span style="color: #66D9EF;">(</span>incr x<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> -&gt; <span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> x <span style="color: #66D9EF;">(</span>+ x 1<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
