8.org
* 反引用和去引用(Backquote and Unquote)
既然limited-save-excursion必须是一个宏函数，我们所要做的就是想象出limited-save-excursion如何展开。让我们开始：
#+BEGIN_SRC emacs-lisp
  (limited-save-excursion
   subexpr1
   subexpr2
   ...)
#+END_SRC

它需要被展开成
#+BEGIN_SRC emacs-lisp
  (let ((orig-point (point)))
    subexpr1
    subexpr2
    ...
    (goto-char orig-point))
#+END_SRC

然后我们要将其编写成宏函数：
#+BEGIN_SRC emacs-lisp
  (defmacro limited-save-excursion (&rest subexprs)
    "Like save-excursion, but only restores point."
    (append '(let ((orig-point (point))))
            subexprs
            '((goto-char orig-point))))
#+END_SRC

回忆之前讲过的append是将每个列表的括号剥掉，然后将他们组合在一起，最后将一个新的括号包在结果的外面。所以这个append的参数为三个列表：
#+BEGIN_SRC emacs-lisp
  (let ((orig-point (point))))
  (subexpr1 subexpr2 ...)
  ((goto-char orig-point))
#+END_SRC

剥掉他们最外面的括号：
#+BEGIN_SRC emacs-lisp
  let ((orig-point (point)))
  subexpr1 subexpr2 ...
  (goto-char orig-point)
#+END_SRC

然后将结果包在新的括号里：
#+BEGIN_SRC emacs-lisp
  (let ((orig-point (point)))
    subexpr1
    subexpr2
    ...
    (goto-char orig-point))
#+END_SRC

这就是宏的展开式，然后再对其求值。

这就能完成我们的需求了，但是阅读理解宏定义是很困难的一件事。幸运的是，还有更好的办法。看起来几乎所有的宏都会调用list和append这种函数来重新组合他们的参数，一些表达式会被括起来而另一些不会。实际上，这是如此常见，以至于Emacs Lisp提供了一个特殊表达式来模板化地编写宏扩展。

记得'expr吗，它会展开成(quote expr)？好吧，还有一个`expr，它将会展开成(backquote expr)。[[[8-32][32]]]反引用(backquote)跟引用(quote)很像，即对反引用表达式求值的结果仍然是表达式本身：
#+BEGIN_SRC emacs-lisp
  `(a b c) -> (a b c)
#+END_SRC

但是有一个重要的区别。一个反引用的列表的子表达式可以各自独立的使用去引用符(unquoted)进行修饰。即当反引用表达式求值时，其中的去引用子表达式也会被求值--而列表中其他的子表达式仍然保持引用状态！
#+BEGIN_SRC emacs-lisp
  `(a ,b c) -> (a value-of-b c)
#+END_SRC

要理解这为什么有用，让我们回到incr的例子。我们可以这么重写incr：
#+BEGIN_SRC emacs-lisp
  (defmacro incr (var)
    "Add one to the named variable."
    `(setq ,var (+ ,var 1)))
#+END_SRC

每个逗号表示子表达式被去引用，所以在这个例子里，一个这种列表：
#+BEGIN_SRC emacs-lisp
  (setq ... (+ ... 1))
#+END_SRC

其中var的值（某个变量名）被插入了两次。结果跟我们第一个版本的incr相同，但是这一次表达的如此清晰。

将反引用和去引用应用到limited-save-excursion上并不能马上变得正确：
#+BEGIN_SRC emacs-lisp
  (defmacro limited-save-excursion (&rest subexprs)
    "Like save-excursion, but only restores point."
    `(let ((orig-point (point)))
       ,subexprs ; 错啦！
       (goto-char orig-point)))
#+END_SRC

对于反引用还有一个细节需要学习。subexprs是一个&rest的参数，他是一个包含着所有传递给limited-save-excursion的参数的列表。因此当它替换到上面的模板里面的时候，它也会是一个列表。换句话说，
#+BEGIN_SRC emacs-lisp
  (limited-save-excursion
   (beginning-of-line)
   (point))
#+END_SRC

将会展开为：
#+BEGIN_SRC emacs-lisp
  (let ((orig-point (point)))
    ((beginning-of-line)
     (point))
    (goto-char orig-point))
#+END_SRC

而这会造成语法错误，因为有括号多余了。我们需要的是一种将subexprs中的值提取到一个列表中，并且移除外面括号的方法。为此，Emacs Lisp提供了另一个特殊语法(最后一个，我保证)：拼接去引用操作符(splicing unquote operator)，,@。这个版本：
#+BEGIN_SRC emacs-lisp
  (defmacro limited-save-excursion (&rest subexprs)
    "Like save-excursion, but only restores point."
    `(let ((orig-point (point)))
       ,@subexprs
       (goto-char orig-point)))
#+END_SRC

将会获取到正确的结果：
#+BEGIN_SRC emacs-lisp
  (let ((orig-point (point)))
    (beginning-of-line)
    (point)
    (goto-char orig-point))
#+END_SRC

