html/8.html

<div id="outline-container-org4b6e371" class="outline-2">
<h2 id="org4b6e371"><span class="section-number-2">5</span> 反引用和去引用(Backquote and Unquote)</h2>
<div class="outline-text-2" id="text-5">
<p>
既然limited-save-excursion必须是一个宏函数，我们所要做的就是想象出limited-save-excursion如何展开。让我们开始：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>limited-save-excursion
 subexpr1
 subexpr2
 ...<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
它需要被展开成<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">let</span> <span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>orig-point <span style="color: #E6DB74;">(</span>point<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
  subexpr1
  subexpr2
  ...
  <span style="color: #66D9EF;">(</span>goto-char orig-point<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
然后我们要将其编写成宏函数：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defmacro</span> <span style="color: #A6E22E;">limited-save-excursion</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">&amp;rest</span> subexprs<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Like save-excursion, but only restores point."</span>
  <span style="color: #66D9EF;">(</span>append '<span style="color: #A6E22E;">(</span><span style="color: #F92672;">let</span> <span style="color: #E6DB74;">(</span><span style="color: #FD971F;">(</span>orig-point <span style="color: #F92672;">(</span>point<span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
          subexprs
          '<span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span>goto-char orig-point<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
回忆之前讲过的append是将每个列表的括号剥掉，然后将他们组合在一起，最后将一个新的括号包在结果的外面。所以这个append的参数为三个列表：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">let</span> <span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>orig-point <span style="color: #E6DB74;">(</span>point<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>subexpr1 subexpr2 ...<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">(</span>goto-char orig-point<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
剥掉他们最外面的括号：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">let <span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">(</span>orig-point <span style="color: #A6E22E;">(</span>point<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
subexpr1 subexpr2 ...
<span style="color: #AE81FF;">(</span>goto-char orig-point<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
然后将结果包在新的括号里：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">let</span> <span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>orig-point <span style="color: #E6DB74;">(</span>point<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
  subexpr1
  subexpr2
  ...
  <span style="color: #66D9EF;">(</span>goto-char orig-point<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
这就是宏的展开式，然后再对其求值。<br />
</p>

<p>
这就能完成我们的需求了，但是阅读理解宏定义是很困难的一件事。幸运的是，还有更好的办法。看起来几乎所有的宏都会调用list和append这种函数来重新组合他们的参数，一些表达式会被括起来而另一些不会。实际上，这是如此常见，以至于Emacs Lisp提供了一个特殊表达式来模板化地编写宏扩展。<br />
</p>

<p>
记得'expr吗，它会展开成(quote expr)？好吧，还有一个`expr，它将会展开成(backquote expr)。[<a href="#org5220f3f">32</a>]反引用(backquote)跟引用(quote)很像，即对反引用表达式求值的结果仍然是表达式本身：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">`<span style="color: #AE81FF;">(</span>a b c<span style="color: #AE81FF;">)</span> -&gt; <span style="color: #AE81FF;">(</span>a b c<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
但是有一个重要的区别。一个反引用的列表的子表达式可以各自独立的使用去引用符(unquoted)进行修饰。即当反引用表达式求值时，其中的去引用子表达式也会被求值&#x2013;而列表中其他的子表达式仍然保持引用状态！<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">`<span style="color: #AE81FF;">(</span>a ,b c<span style="color: #AE81FF;">)</span> -&gt; <span style="color: #AE81FF;">(</span>a value-of-b c<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
要理解这为什么有用，让我们回到incr的例子。我们可以这么重写incr：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defmacro</span> <span style="color: #A6E22E;">incr</span> <span style="color: #66D9EF;">(</span>var<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Add one to the named variable."</span>
  `<span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> ,var <span style="color: #A6E22E;">(</span>+ ,var 1<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
每个逗号表示子表达式被去引用，所以在这个例子里，一个这种列表：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> ... <span style="color: #66D9EF;">(</span>+ ... 1<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
其中var的值（某个变量名）被插入了两次。结果跟我们第一个版本的incr相同，但是这一次表达的如此清晰。<br />
</p>

<p>
将反引用和去引用应用到limited-save-excursion上并不能马上变得正确：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defmacro</span> <span style="color: #A6E22E;">limited-save-excursion</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">&amp;rest</span> subexprs<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Like save-excursion, but only restores point."</span>
  `<span style="color: #66D9EF;">(</span><span style="color: #F92672;">let</span> <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span>orig-point <span style="color: #FD971F;">(</span>point<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
     ,subexprs <span style="color: #75715E;">; </span><span style="color: #75715E;">&#38169;&#21862;&#65281;</span>
     <span style="color: #A6E22E;">(</span>goto-char orig-point<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
对于反引用还有一个细节需要学习。subexprs是一个&amp;rest的参数，他是一个包含着所有传递给limited-save-excursion的参数的列表。因此当它替换到上面的模板里面的时候，它也会是一个列表。换句话说，<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>limited-save-excursion
 <span style="color: #66D9EF;">(</span>beginning-of-line<span style="color: #66D9EF;">)</span>
 <span style="color: #66D9EF;">(</span>point<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
将会展开为：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">let</span> <span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>orig-point <span style="color: #E6DB74;">(</span>point<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>beginning-of-line<span style="color: #A6E22E;">)</span>
   <span style="color: #A6E22E;">(</span>point<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>goto-char orig-point<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
而这会造成语法错误，因为有括号多余了。我们需要的是一种将subexprs中的值提取到一个列表中，并且移除外面括号的方法。为此，Emacs Lisp提供了另一个特殊语法(最后一个，我保证)：拼接去引用操作符(splicing unquote operator)，,@。这个版本：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defmacro</span> <span style="color: #A6E22E;">limited-save-excursion</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">&amp;rest</span> subexprs<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Like save-excursion, but only restores point."</span>
  `<span style="color: #66D9EF;">(</span><span style="color: #F92672;">let</span> <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span>orig-point <span style="color: #FD971F;">(</span>point<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
     ,@subexprs
     <span style="color: #A6E22E;">(</span>goto-char orig-point<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
将会获取到正确的结果：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">let</span> <span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>orig-point <span style="color: #E6DB74;">(</span>point<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>beginning-of-line<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>point<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>goto-char orig-point<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
