html/8.html

<div id="outline-container-org640d227" class="outline-2">
<h2 id="org640d227"><span class="section-number-2">6</span> 返回值</h2>
<div class="outline-text-2" id="text-6">
<p>
要完成limited-save-excursion我们还有很多事情要做。比如，它并没有返回subexprs的最后一个表达式，而save-excursion会。limited-save-excursion返回了并没有什么帮助的(goto-char orig-point)的值，也就是orig-point的值，因为goto-char会返回它的参数。而当你希望使用这个值的时候，这显然是不正确的：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> line-start <span style="color: #66D9EF;">(</span>limited-save-excursion
                  <span style="color: #A6E22E;">(</span>beginning-of-line<span style="color: #A6E22E;">)</span>
                  <span style="color: #A6E22E;">(</span>point<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
</pre>
</div>

<p>
为了修复这个问题，我们必须记录最后一个表达式的值，然后恢复point，然后返回之前储存起来的值。我们可能会这么做：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defmacro</span> <span style="color: #A6E22E;">limited-save-excursion</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">&amp;rest</span> subexprs<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Like save-excursion, but only restores point."</span>
  `<span style="color: #66D9EF;">(</span><span style="color: #F92672;">let</span> <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span>orig-point <span style="color: #FD971F;">(</span>point<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
         <span style="color: #E6DB74;">(</span>result <span style="color: #FD971F;">(</span><span style="color: #F92672;">progn</span> ,@subexprs<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
     <span style="color: #A6E22E;">(</span>goto-char orig-point<span style="color: #A6E22E;">)</span>
     result<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
注意到progn的使用，它的作用是执行每个传递给它的参数然后返回最后一个参数的值&#x2013;这正是我们的宏所希望的。但是，这个版本因为两个原因是错误的。第一个原因跟let的工作机制有关。当下面这个表达式执行时：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">let</span> <span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>var1 val1<span style="color: #A6E22E;">)</span>
      <span style="color: #A6E22E;">(</span>var2 val2<span style="color: #A6E22E;">)</span>
      ...
      <span style="color: #A6E22E;">(</span>varn valn<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
  body ...<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
所有vals会在任何vars赋值之前执行，所以没有val能引用到var。而且，它们执行的顺序也是随机的。所以，如果我们使用上面版本的limited-save-excursion来将<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>limited-save-excursion
 <span style="color: #66D9EF;">(</span>beginning-of-line<span style="color: #66D9EF;">)</span>
 <span style="color: #66D9EF;">(</span>point<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
扩展为<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">let</span> <span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>orig-point <span style="color: #E6DB74;">(</span>point<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
      <span style="color: #A6E22E;">(</span>result <span style="color: #E6DB74;">(</span><span style="color: #F92672;">progn</span> <span style="color: #FD971F;">(</span>beginning-of-line<span style="color: #FD971F;">)</span>
                     <span style="color: #FD971F;">(</span>point<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
      <span style="color: #66D9EF;">(</span>goto-char orig-point<span style="color: #66D9EF;">)</span>
      result<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
那么很有可能，当对这个表达式求值时，beggining-of-line会先于写在前面的point执行，而这会导致orig-point的值的错误。<br />
</p>

<p>
对于这个问题的解决方法是使用let*代替let。当使用let*时，就没有了这种不确定性：vals的执行顺序就是它们在代码中所写的顺序。[<a href="#orge053b7d">33</a>]而且，每个var都会在对应的val求值之后马上赋值，所以vali可以引用从var1到vari-1之间的值。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defmacro</span> <span style="color: #A6E22E;">limited-save-excursion</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">&amp;rest</span> subexprs<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Like save-excursion, but only restores point."</span>
  `<span style="color: #66D9EF;">(</span><span style="color: #F92672;">let*</span> <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span>orig-point <span style="color: #FD971F;">(</span>point<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
          <span style="color: #E6DB74;">(</span>result <span style="color: #FD971F;">(</span><span style="color: #F92672;">progn</span> ,@subexprs<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
     <span style="color: #A6E22E;">(</span>goto-char orig-point<span style="color: #A6E22E;">)</span>
     result<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
下一个问题的修复就没这么简单了。假设子表达式中使用了全局变量orig-point。就像我们刚刚提到的，每个val都可以访问到前面的vars，所以如果子表达式中引用了orig-point，它将会因此引用到limited-save-excursion中定义的那个orig-point局部变量&#x2013;这几乎可以肯定不是子表达式的作者所希望使用的。宏展开的子表达式会使用这个变量。这会对子表达式的编写造成很大的困扰，因为它所希望操作的完全是另一个变量。而假如这些子表达式又对orig-point的值进行了修改，这反过来又会影响到limited-save-excursion自身。<br />
</p>

<p>
我们将子表达式的执行放入定义了orig-point局部变量的let*，却因此将子表达式“真正”希望使用的orig-point给隐藏起来了。<br />
</p>

<p>
你可能会想到规避这个问题的一个好方法是为orig-point挑选一个不大可能出现在子表达式中的其他名称。这并不是一个令人满意的解决方案，因为(a)不管你定义的变量名如何特殊，总是有可能会发生重复，(b)况且这件事有正确的解决方法。正确的方法是产生一个肯定不会与其他在使用的变量产生冲突的新变量。那么如何做呢？<br />
</p>

<p>
要回答这个问题，我们首先需要理解两个符号发生冲突表示什么。两个符号只有在表示同一个对象时才会冲突，而不仅仅是名字相同。当你向Lisp程序中输入一个符号名时，Lisp解释器在内部会将其转化为一个符号对象。符号对象包含着比它的名字更多的信息。它包含着这个符号的局部和全局的变量绑定关系；它包含着任何与这个符号绑定的函数定义(使用defun)；以及包含着符号的属性列表(参照<a href="3.html">第三章</a>的<a href="3.html#MissingReference">符号属性</a>部分)。<br />
</p>

<p>
将编写的Lisp代码转换成像符号对象(或者cons cell等)这种内部数据结构的过程称为reading。当Lisp"解释器"两次看到同一个符号名时，它并不会创建两个内部符号对象&#x2013;它会重用同一个。<br />
</p>

<p>
可能你看出来我们需要怎么做了：如果我们能够获取到一个其他的符号对象，而不是通过Lisp自己的内部符号和重用机制，那么Lisp就不会认为它跟其他符号对象是同一个，即使它们有着同样的名字。创建这种符号的方法是通过函数make-symbol，它使用符号的名称(一个字符串)来创建一个新的，非内部的，保证与其他对象都不同的对象。<br />
</p>

<p>
换句话说，<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>make-symbol <span style="color: #E6DB74;">"orig-point"</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
将不会与任何其他地方出现过的orig-point冲突。新创建的orig-point与其他之前创建的对象都不同。<br />
</p>

<p>
在你想避免与其他变量引用冲突的时候，使用新的、非内部的符号是一种很安全的做法。下面是我们函数的改进版本：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defmacro</span> <span style="color: #A6E22E;">limited-save-excursion</span> <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">&amp;rest</span> subexprs<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Like save-excursion, but only restores point."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">let</span> <span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">(</span>orig-point-symbol <span style="color: #FD971F;">(</span>make-symbol <span style="color: #E6DB74;">"orig-point"</span><span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
    `<span style="color: #A6E22E;">(</span><span style="color: #F92672;">let*</span> <span style="color: #E6DB74;">(</span><span style="color: #FD971F;">(</span>,orig-point-symbol <span style="color: #F92672;">(</span>point<span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span>
            <span style="color: #FD971F;">(</span>result <span style="color: #F92672;">(</span><span style="color: #F92672;">progn</span> ,@subexprs<span style="color: #F92672;">)</span><span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
       <span style="color: #E6DB74;">(</span>goto-char ,orig-point-symbol<span style="color: #E6DB74;">)</span>
       result<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
第一个let创建了一个名为orig-point的新符号对象，并且不与任何其他符号相同，包括同样名为orig-point的对象。这个新的对象被赋值给orig-point-symbol，然后在后面的反引用模板里(通过去引用)使用了两次。<br />
</p>

<p>
乍看起来，我们只是将orig-point冲突的危险转换为了orig-point-symbol的危险。但是orig-point-symbol实际上并不会出现在宏的展开式里，展开式看起来大概是这样的(orig-point'代表了使用make-symbol创建的非内部的符号):<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">let*</span> <span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>orig-point' <span style="color: #E6DB74;">(</span>point<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
       <span style="color: #A6E22E;">(</span>result <span style="color: #E6DB74;">(</span><span style="color: #F92672;">progn</span> subexprs<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>goto-char orig-point'<span style="color: #66D9EF;">)</span>
  result<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
所以在subexprs执行的时候&#x2013;在宏展开之后&#x2013;唯一的临时变量是orig-point'，而这是唯一的。临时变量result这时还不存在。所以变量冲突的问题彻底解决了。<br />
</p>
</div>
</div>
