8.org
* 优雅的失败
当Emacs中发生错误时，当前的计算将会终止而Emacs会返回到上层的主循环，在那里它会等待按键或者其他输入。当执行limited-save-excursion子表达式发生错误时，整个limited-save-excursion将会在调用goto-char之前终止，而point的值将会变为未知的一个值而不会恢复。但是真正的save-excursion即使在错误发生时也可以正确的恢复point(以及mark和当前buffer)。这是怎么做到的？

调用函数的信息被存在一个称为栈(stack)的内部数据结构里。错误发生之后，回到顶层主循环将会弹出这个栈，以相反的顺序每次弹出一个函数调用--所以如果a调用了b，b调用了c，然后错误发生了，c将会弹出，然后是b，然后是a，直到Emacs回到"顶层"。

在栈弹出时执行编写的Lisp代码是可能的！这是编写"优雅的"失败处理的关键，使得我们可以在函数自己由于一些错误(或者用户自己触发C-g)而无法完成时对其进行清理。我们要使用的函数称为unwind-protect，它会正常执行输入的第一个表达式，后面跟着任意数量需要后续执行的表达式--即使异常打断了第一个表达式的执行。它看起来是这样的：
#+BEGIN_SRC emacs-lisp
  (unwind-protect
      normal
    cleanup1
    cleanup2
    ...)
#+END_SRC

显然，我们需要将对于point值的恢复行为放到unwind-protect的"清理"部分：
#+BEGIN_SRC emacs-lisp
  (defmacro limited-save-excursion (&rest subexprs)
    "Like save-excursion, but only restores point."
    (let ((orig-point-symbol (make-symbol "orig-point")))
      `(let ((,orig-point-symbol (point)))
         (unwind-protect
             (progn ,@subexprs)
           (goto-char ,orig-point-symbol)))))
#+END_SRC

unwind-protect的一个好的特性是在非错误的情况下，它的返回值是"正常"表达式的值(如果错误发生了，返回值并没有意义)。在这个例子里，也就是(progn ,@subexprs)，正是我们希望的limited-save-excursion的返回值，所以我们可以移除掉之前的result变量，并且将let*改回let。

* 点标记
在最后对于limited-save-excursion的改进里，我们将会把point记录为一个标记，而非一个数字，就像我们在unscroll中所定义的那样(参照[[file:3.org][第三章]][[file:3.org::*标记][标记]]部分)：也就是说，对于子表达式的执行可能会使保存的buffer位置变得不准确，因为文本可能已经被插入或删除掉了。

要做的修改非常简单。将返回数值的point调用，替换为将当前位置表达为一个标记的point-marker就可以了。
#+BEGIN_SRC emacs-lisp
  (defmacro limited-save-excursion (&rest subexprs)
    "Like save-excursion, but only restores point."
    (let ((orig-point-symbol (make-symbol "orig-point")))
      `(let ((,orig-point-symbol (point-marker)))
         (unwind-protect
             (progn ,@subexprs)
           (goto-char ,orig-point-symbol)))))
#+END_SRC

现在剩下的就是将这个定义存入一个名为limited.el的文件，后面加上
#+BEGIN_SRC emacs-lisp
  (provide 'limited)
#+END_SRC

然后放入一个load-path中存在的路径并且对其进行字节编译(参考[[file:5.org][第五章]])。然后在refill.el中我们可以把save-excursion的调用替换为limited-save-excursion；在refill.el的开头添加
#+BEGIN_SRC emacs-lisp
  (require 'limited)
#+END_SRC

然后对其字节编译。这样当refill载入的时候才会载入limited，并且如果你将
#+BEGIN_SRC emacs-lisp
  (autoload 'refill-mode "refill" "Refill minor mode." t)
#+END_SRC

添加到你的.emacs中，那么直到你触发refill-mode时才会载入refill。

<<8-31>>[31]. 不要把宏函数与键盘宏混淆，也就是Emacs的名字（“editor macros”）的来源。

<<8-32>>[32]. 这个表达式是Emacs 19.29新引入的。在之前的版本里，它们必须像函数调用一样触发，例如：(` expr)。

<<8-33>>[33]. 如果let如此模糊而let*这么清晰，那么为什么不只用let*呢？答案是：let在某些情况下跟高效。而且，有时你就是会需要在任何vars存在之前就计算出所有的vals。通常，你应该使用let除非你确实需要let*--当然你应该能够想到，不恰当地选择使用它们是常见的程序异常来源之一。
